udaybhan200683/Ghar_sajag/code/ParivarSathi_v1.5.4_PWA_BatteryAnalytics_v3_4_2/firmware/node/target/esp32c3/node_runtime_adapter.cpp
#if !GS_HIL_BUILD
bool send_security_message(const NodeSecurityLink::Outbound& outbound) {
    security::wire::Message message = outbound.message;
    std::vector<security::wire::Packet> packets;
    std::uint32_t transaction = esp_random();
    if (transaction == 0) transaction = 1;
    if (!security::wire::fragment(message, transaction, packets)) return false;
    if (!esp_now_is_peer_exist(outbound.destination.data())) {
        esp_now_peer_info_t peer{};
        std::memcpy(peer.peer_addr, outbound.destination.data(), outbound.destination.size());
        peer.channel = 0;
        peer.ifidx = WIFI_IF_STA;
        peer.encrypt = false;  // Application AEAD protects runtime after rejoin.
        if (esp_now_add_peer(&peer) != ESP_OK) return false;
    }
    for (const auto& packet : packets) {
        (void)xQueueReset(g_security_send_queue);
        if (esp_now_send(outbound.destination.data(), packet.bytes.data(),
                         packet.size) != ESP_OK) return false;
        SendResult result;
        if (xQueueReceive(g_security_send_queue, &result,
                          pdMS_TO_TICKS(kSendCallbackTimeoutMs)) != pdTRUE ||
            !result.accepted_by_radio) return false;
    }
    return true;
}
#endif

void owner_task(void*) {
    PowerPolicy power_policy;
    EnergyCounters energy;
    energy.boot_count = 1;
    const auto boot_reset = esp_reset_reason();
    if (boot_reset == ESP_RST_BROWNOUT) energy.brownout_count = 1;
    if (boot_reset == ESP_RST_PANIC || boot_reset == ESP_RST_TASK_WDT ||
        boot_reset == ESP_RST_INT_WDT || boot_reset == ESP_RST_WDT ||
        boot_reset == ESP_RST_BROWNOUT) energy.unexpected_resets = 1;
#if !GS_HIL_BUILD
    NodeSecurityLink security_link;
    std::array<std::uint8_t, 6> physical_mac{};
    if (esp_wifi_get_mac(WIFI_IF_STA, physical_mac.data()) != ESP_OK ||
        !security_link.initialize(physical_mac, g_session_id, monotonic_ms())) {
        ESP_LOGE(kTag, "Node security bootstrap failed closed");
        vTaskDelete(nullptr);
        return;
    }
    auto last_outbound = security_link.initial_message();
    const bool rejoining_existing_association = last_outbound.has_value();
    if (last_outbound) (void)send_security_message(*last_outbound);
    Milliseconds next_security_retry_ms = monotonic_ms() + 1500;
    while (!security_link.ready()) {
        if (security_link.faulted()) {
            ESP_LOGE(kTag, "Node security owner faulted; runtime admission disabled");
            vTaskDelete(nullptr);
            return;
        }
        ReceivedFrame frame;
        if (xQueueReceive(g_security_queue, &frame, pdMS_TO_TICKS(100)) == pdTRUE) {
            const auto response = security_link.accept(frame.source_mac,
                frame.bytes.data(), frame.size, monotonic_ms());
            if (response) {
                last_outbound = response;
                (void)send_security_message(*response);
                next_security_retry_ms = monotonic_ms() + 1500;
            }
        }
        if (last_outbound && monotonic_ms() >= next_security_retry_ms) {
            (void)send_security_message(*last_outbound);
            next_security_retry_ms = monotonic_ms() + 3000;
        }
    }
    if (rejoining_existing_association) energy.authenticated_rejoins = 1;
    g_security_phase.store(false, std::memory_order_release);
    NodeRuntime runtime(security_link.binding()->logical_id, g_session_id);
#else
    g_security_phase.store(false, std::memory_order_release);
    NodeRuntime runtime(kNodeId, g_session_id);
#endif
#if !GS_HIL_BUILD
    // Restore retained identities only after the new boot session has been
    // authenticated. A corrupt or unreadable record must not start sensing.
    if (!security_link.restore_recovery(runtime, monotonic_ms())) {
        ESP_LOGE(kTag, "Node recovery restore failed; refusing event admission");
        vTaskDelete(nullptr);
        return;
    }
#endif
    g_ota_owner_started.store(true, std::memory_order_release);
    QualifiedInput pir(EventKind::Motion, std::nullopt, kPirDebounceMs,
                       kPirMinimumRetriggerMs);
    std::optional<EventKey> in_flight;
    bool health_in_flight = false;
    Milliseconds sent_at_ms = 0;
    Milliseconds led_off_at_ms = 0;
    Milliseconds next_health_ms =
#if GS_HIL_CONTROL
        1000;
#else
        kHealthIntervalMs;
#endif
    std::uint64_t health_sequence = 1;
    std::uint32_t raw_pir_edges = 0;
    std::uint32_t accepted_pir = 0;
    std::uint32_t rejected_pir = 0;
    std::uint32_t sensing_liveness = 0;
    std::uint32_t runtime_liveness = 0;
    std::uint32_t send_attempts = 0;
    std::uint32_t mac_success_count = 0;
    std::uint32_t mac_failure_count = 0;
    bool previous_raw_pir = false;
    bool raw_initialized = false;
    bool previous_maintenance = false;
    NodeBreadcrumb breadcrumb = NodeBreadcrumb::Boot;
    NodeHealthError last_error = NodeHealthError::None;
    const std::uint32_t reset_reason = static_cast<std::uint32_t>(esp_reset_reason());

    ESP_LOGI(kTag, "NodeRuntime owner started session=%llu channel=%u tx_power_qdbm=%d",
             static_cast<unsigned long long>(g_session_id),
             static_cast<unsigned>(kEspNowChannel),
             kTxPowerQuarterDbm);
    vTaskDelay(pdMS_TO_TICKS(kPirStabilizationMs));
    ESP_LOGI(kTag, "PIR ready on GPIO%d", kPirGpio);
    g_ota_sensing_ready.store(true, std::memory_order_release);
    const esp_partition_t* running = esp_ota_get_running_partition();
    esp_ota_img_states_t ota_state{};
    if (running != nullptr &&
        esp_ota_get_state_partition(running, &ota_state) == ESP_OK &&
        ota_state == ESP_OTA_IMG_PENDING_VERIFY) {
        // A pending image needs fresh post-sensing radio evidence. Ordinary
        // boots keep the configured health interval.
        next_health_ms = monotonic_ms();
    }

    for (;;) {
        const Milliseconds now = monotonic_ms();
        energy.awake_ms = static_cast<std::uint64_t>(now);
        const auto ack_drops = g_ack_queue_drops.exchange(0U, std::memory_order_relaxed);
        ++sensing_liveness;
        ++runtime_liveness;
        const auto control_drops = g_control_queue_drops.exchange(0U, std::memory_order_relaxed);
        const auto send_drops = g_send_queue_drops.exchange(0U, std::memory_order_relaxed);
        const auto fota_timeouts = g_fota_timeouts.exchange(0U, std::memory_order_relaxed);
        if (ack_drops != 0U || control_drops != 0U || send_drops != 0U) {
            ESP_LOGW(kTag, "Callback queue drops ACK=%u CONTROL=%u SEND=%u",
                     static_cast<unsigned>(ack_drops), static_cast<unsigned>(control_drops),
                     static_cast<unsigned>(send_drops));
            if (ack_drops != 0U) last_error = NodeHealthError::AckQueueDrop;
            else if (control_drops != 0U) last_error = NodeHealthError::ControlQueueDrop;
            else last_error = NodeHealthError::SendQueueDrop;
        }
        if (fota_timeouts != 0U) {
            last_error = NodeHealthError::FotaTimeout;
        }
        ReceivedFrame ack_frame;
        while (xQueueReceive(g_ack_queue, &ack_frame, 0) == pdTRUE) {
#if !GS_HIL_BUILD
            if (ack_frame.source_mac != security_link.hub_mac()) continue;
            security::SecureFrame protected_ack;
            protected_ack.size = ack_frame.size;
            std::copy_n(ack_frame.bytes.data(), ack_frame.size,
                        protected_ack.bytes.data());
            transport::EncodedFrame verified_ack;
            if (!security_link.frames()->open(security::RuntimeDirection::Downlink,
                                              protected_ack, verified_ack)) {
                ESP_LOGW(kTag, "Rejected unauthenticated or replayed ACK");
                continue;
            }
            if (verified_ack.size >= 2 && verified_ack.bytes[0] == 'G' &&
                verified_ack.bytes[1] == 'F') {
                const auto decoded_fota = gs::fota::secure_wire::decode(
                    verified_ack.bytes.data(), verified_ack.size);
                if (!decoded_fota || decoded_fota.message.type ==
                                     gs::fota::secure_wire::Type::Ack) {
                    ESP_LOGW(kTag, "Rejected malformed protected FOTA control");
                    continue;
                }
                ReceivedFrame verified_control;
                verified_control.source_mac = ack_frame.source_mac;
                verified_control.authenticated_session = security_link.frames()->session();
                verified_control.size = verified_ack.size;
                std::copy_n(verified_ack.bytes.data(), verified_ack.size,
                            verified_control.bytes.data());
                if (xQueueSend(g_control_queue, &verified_control, 0) != pdTRUE)
                    g_control_queue_drops.fetch_add(1U, std::memory_order_relaxed);
                continue;
            }
            const auto decoded = transport::decode_node_ack(
                verified_ack.bytes.data(), verified_ack.size);
#else
            if (!from_qualified_hub(ack_frame.source_mac.data())) continue;
            const auto decoded = transport::decode_node_ack(
                ack_frame.bytes.data(), ack_frame.size);
#endif
            if (!decoded) {
                ESP_LOGW(kTag, "Rejected malformed ACK error=%d", static_cast<int>(decoded.error));
                continue;
            }
            const EventKey key{decoded.value->node_id, decoded.value->session_id,
                               decoded.value->sequence_number};
#if !GS_HIL_BUILD
            const auto pending_before = runtime.pending();
            const auto retained_before = runtime.persisted();
#endif
            const bool retired = runtime.acknowledge(key, decoded.value->ack_type);
            if (retired) power_policy.observe_authenticated_contact();
#if !GS_HIL_BUILD
            if ((runtime.pending() != pending_before ||
                 runtime.persisted() != retained_before) &&
                !security_link.persist_recovery(runtime)) {
                ESP_LOGE(kTag, "Node recovery ACK retirement commit failed; stopping owner");
                vTaskDelete(nullptr);
                return;
            }
            if (runtime.pending() != pending_before ||
                runtime.persisted() != retained_before)
                energy.record_recovery_commit();
#endif
            breadcrumb = retired ? NodeBreadcrumb::EventRetired : NodeBreadcrumb::AppAck;
            ESP_LOGI(kTag, "Application ACK session=%llu seq=%llu class=%d retired=%d",
                     static_cast<unsigned long long>(key.session_id),
                     static_cast<unsigned long long>(key.sequence),
                     static_cast<int>(decoded.value->ack_type), retired);
        }

