udaybhan200683/Ghar_sajag/code/ParivarSathi_v1.5.4_PWA_BatteryAnalytics_v3_4_2/firmware/node/target/esp32c3/node_runtime_adapter.cpp
#if !GS_HIL_BUILD
        AuthenticatedFotaAck fota_ack;
        while (xQueueReceive(g_fota_ack_queue, &fota_ack, 0) == pdTRUE) {
            // A failed transfer may have left an ACK queued before the OTA
            // worker cleared maintenance. Do not let its MAC callback be
            // mistaken for a normal NodeRuntime send after resumption.
            if (!g_control_plane_active.load(std::memory_order_acquire) ||
                !security_link.ready() ||
                security_link.frames()->session() != fota_ack.authenticated_session ||
                fota_ack.message.type != gs::fota::secure_wire::Type::Ack) continue;
            const auto encoded = gs::fota::secure_wire::encode(fota_ack.message);
            security::SecureFrame protected_fota_ack;
            if (!encoded || !security_link.frames()->seal(
                    security::RuntimeDirection::Uplink, encoded.frame,
                    protected_fota_ack)) continue;
            if (esp_now_send(security_link.hub_mac().data(),
                             protected_fota_ack.bytes.data(),
                             protected_fota_ack.size) != ESP_OK) {
                ESP_LOGW(kTag, "Authenticated FOTA ACK send rejected");
            }
        }
#endif

        SendResult send_result;
        while (xQueueReceive(g_send_queue, &send_result, 0) == pdTRUE) {
            if (send_result.accepted_by_radio) ++mac_success_count;
            else ++mac_failure_count;
            if (in_flight) {
                runtime.transport_result(*in_flight, send_result.accepted_by_radio, now);
                power_policy.observe_unacknowledged_attempt();
                breadcrumb = send_result.accepted_by_radio
                    ? NodeBreadcrumb::WaitAppAck : NodeBreadcrumb::RetryBackoff;
                ESP_LOGI(kTag, "MAC result session=%llu seq=%llu accepted=%d",
                         static_cast<unsigned long long>(in_flight->session_id),
                         static_cast<unsigned long long>(in_flight->sequence),
                         send_result.accepted_by_radio);
                in_flight.reset();
            } else if (health_in_flight) {
                if (send_result.accepted_by_radio &&
                    g_ota_sensing_ready.load(std::memory_order_acquire)) {
                    g_ota_post_sensing_radio_confirmed.store(true,
                                                             std::memory_order_release);
                }
                health_in_flight = false;
            }
        }
        if (in_flight && now - sent_at_ms >= kSendCallbackTimeoutMs) {
            runtime.transport_result(*in_flight, false, now);
            power_policy.observe_unacknowledged_attempt();
            ESP_LOGW(kTag, "MAC callback timeout session=%llu seq=%llu",
                     static_cast<unsigned long long>(in_flight->session_id),
                     static_cast<unsigned long long>(in_flight->sequence));
            in_flight.reset();
            ++mac_failure_count;
            breadcrumb = NodeBreadcrumb::RetryBackoff;
            last_error = NodeHealthError::MacCallbackTimeout;
        } else if (health_in_flight && now - sent_at_ms >= kSendCallbackTimeoutMs) {
            health_in_flight = false;
            ++mac_failure_count;
            last_error = NodeHealthError::MacCallbackTimeout;
        }

        const bool maintenance = g_control_plane_active.load(std::memory_order_acquire);
        if (maintenance != previous_maintenance) {
            breadcrumb = maintenance ? NodeBreadcrumb::FotaPause : NodeBreadcrumb::FotaResume;
            previous_maintenance = maintenance;
        }
        const bool raw_pir = gpio_get_level(static_cast<gpio_num_t>(kPirGpio)) != 0;
        if (!raw_initialized) {
            previous_raw_pir = raw_pir;
            raw_initialized = true;
        } else if (raw_pir != previous_raw_pir) {
            previous_raw_pir = raw_pir;
            ++raw_pir_edges;
            breadcrumb = NodeBreadcrumb::PirRaw;
        }
        auto sensed = pir.sample(raw_pir, now);
#if GS_HIL_CONTROL
        auto pending = g_hil_motion_pending.load(std::memory_order_acquire);
        while (pending != 0U &&
               !g_hil_motion_pending.compare_exchange_weak(
                   pending, pending - 1U, std::memory_order_acq_rel)) {}
        if (pending != 0U) {
            // HIL injection replaces only the electrical/optical observation.
            // Everything from EventKind admission onward is the production path.
            sensed = EventKind::Motion;
            ESP_LOGI(kTag, "HIL synthetic sensing boundary accepted");
        }
#endif
        if (sensed) {
            ++accepted_pir;
            breadcrumb = NodeBreadcrumb::PirAccepted;
            // GPIO8 is a local qualified-PIR indication. It is deliberately
            // independent of store admission, radio delivery and Hub ACK.
            (void)gpio_set_level(static_cast<gpio_num_t>(kLedGpio),
                                 kLedActiveLow ? 0 : 1);
            led_off_at_ms = now + 200;
            if (!maintenance) {
                breadcrumb = NodeBreadcrumb::EventRecordEnter;
                const auto store_full_before = runtime.stats().store_full;
#if !GS_HIL_BUILD
                const bool gap_was_required = runtime.gap_marker_required();
#endif
                const auto key = runtime.record(*sensed,
#if !GS_HIL_BUILD
                                                security_link.binding()->room,
#else
                                                kLocation,
#endif
                                                now, 0,
                                                24U * 60U * 60U, 0, false,
                                                SensorType::Pir, 0);
                if (key) {
#if !GS_HIL_BUILD
                    // Commit the event and its retry identity before any
                    // ESP-NOW send can make this event visible to the Hub.
                    if (!security_link.persist_recovery(runtime)) {
                        ESP_LOGE(kTag, "Node recovery event commit failed; stopping owner");
                        vTaskDelete(nullptr);
                        return;
                    }
                    energy.record_recovery_commit();
#endif
                    breadcrumb = NodeBreadcrumb::EventRecordOk;
                    ESP_LOGI(kTag, "PIR -> NodeRuntime session=%llu seq=%llu",
                             static_cast<unsigned long long>(key->session_id),
                             static_cast<unsigned long long>(key->sequence));
                } else {
                    ++rejected_pir;
                    const bool store_full = runtime.stats().store_full != store_full_before;
                    breadcrumb = store_full ? NodeBreadcrumb::StoreFull
                                            : NodeBreadcrumb::EventRecordRejected;
                    last_error = store_full ? NodeHealthError::StoreFull
                                            : NodeHealthError::TxQueueFull;
#if !GS_HIL_BUILD
                    if (!gap_was_required && runtime.gap_marker_required() &&
                        !security_link.persist_recovery(runtime)) {
                        ESP_LOGE(kTag, "Node recovery gap commit failed; stopping owner");
                        vTaskDelete(nullptr);
                        return;
                    }
                    if (!gap_was_required && runtime.gap_marker_required())
                        energy.record_recovery_commit();
#endif
                }
            } else {
                ++rejected_pir;
            }
        }
        if (led_off_at_ms != 0 && now >= led_off_at_ms) {
            (void)gpio_set_level(static_cast<gpio_num_t>(kLedGpio), kLedActiveLow ? 1 : 0);
            led_off_at_ms = 0;
        }

        if (!in_flight && !health_in_flight && !maintenance &&
            (now >= next_health_ms
#if GS_HIL_CONTROL
             || g_hil_force_health.exchange(false, std::memory_order_acq_rel)
#endif
            )) {
            const auto& stats = runtime.stats();
            const auto& radio_stats = runtime.radio_stats();
            const auto oldest = runtime.oldest_pending_key();
            NodeHealthSnapshot health;
#if !GS_HIL_BUILD
            health.node_id = security_link.binding()->logical_id;
#else
            health.node_id = kNodeId;
#endif
            health.session_id = g_session_id;
            health.health_sequence = health_sequence++;
            health.uptime_ms = static_cast<std::uint64_t>(now);
            health.reset_reason = reset_reason;
            health.raw_pir_level = raw_pir;
            health.raw_pir_edges = raw_pir_edges;
            health.accepted_pir = accepted_pir;
            health.rejected_pir = rejected_pir;
            health.store_full = stats.store_full;
            health.dropped_motion = stats.dropped_motion;
            health.priority_rejected = stats.priority_rejected;
            health.sensing_liveness = sensing_liveness;
            health.runtime_liveness = runtime_liveness;
            health.last_breadcrumb = breadcrumb;
            health.retained_count = static_cast<std::uint16_t>(runtime.persisted());
            health.oldest_sequence = oldest ? oldest->sequence : 0U;
            health.radio_in_flight = false;
            health.tx_attempts = send_attempts;
            health.mac_success = mac_success_count;
            health.mac_failure = mac_failure_count;
            health.durable_acks = stats.durable_acks;
            health.volatile_acks = stats.volatile_acks;
            health.retries = radio_stats.retries;
            health.periodic_backoff_entries = radio_stats.periodic_backoff_entries;
            health.last_error = last_error;
            health.free_heap = esp_get_free_heap_size();
            health.minimum_free_heap = esp_get_minimum_free_heap_size();
            health.maintenance_active = maintenance;
            ESP_LOGI(kTag,
                     "Power counters uptime_ms=%llu loops=%llu pir=%llu app_tx=%llu "
                     "mac_attempt=%llu retry=%llu health=%llu rejoin=%llu "
                     "recovery_commit=%llu queue_hwm=%u unexpected_reset=%llu",
                     static_cast<unsigned long long>(energy.awake_ms),
                     static_cast<unsigned long long>(energy.sensing_loops),
                     static_cast<unsigned long long>(energy.qualified_pir),
                     static_cast<unsigned long long>(energy.application_tx_attempts),
                     static_cast<unsigned long long>(energy.mac_send_attempts),
                     static_cast<unsigned long long>(energy.radio_retries),
                     static_cast<unsigned long long>(energy.heartbeat_count),
                     static_cast<unsigned long long>(energy.authenticated_rejoins),
                     static_cast<unsigned long long>(energy.recovery_nvs_commits),
                     static_cast<unsigned>(energy.queue_high_water),
                     static_cast<unsigned long long>(energy.unexpected_resets));
            const auto encoded = transport::encode_node_health(health);
            next_health_ms = now + kHealthIntervalMs;
            if (encoded) {
#if !GS_HIL_BUILD
                security::SecureFrame protected_health;
                if (!security_link.frames()->seal(security::RuntimeDirection::Uplink,
                                                  encoded.frame, protected_health)) {
                    last_error = NodeHealthError::EncodeFailed;
                    continue;
                }
                ++send_attempts;
                const esp_err_t sent = esp_now_send(security_link.hub_mac().data(),
                                                    protected_health.bytes.data(),
                                                    protected_health.size);
#else
                ++send_attempts;
                const esp_err_t sent = esp_now_send(kQualifiedHubMac.data(),
                                                    encoded.frame.bytes.data(),
                                                    encoded.frame.size);
#endif
                energy.record_mac_attempt(false, sent == ESP_OK);
                if (sent == ESP_OK) {
                    ++energy.heartbeat_count;
                    health_in_flight = true;
                    sent_at_ms = now;
                }
            }
        }

        if (!in_flight && !health_in_flight && !maintenance) {
            const auto message = runtime.next_message(now);
            if (message) {
                breadcrumb = NodeBreadcrumb::TxPrepare;
                const EventKey key{message->node_id, message->session_id,
                                   message->sequence_number};
                const auto encoded = transport::encode_node_message(*message);
                if (!encoded) {
                    ESP_LOGE(kTag, "NodeMessage encode failed error=%d", static_cast<int>(encoded.error));
                    runtime.transport_result(key, false, now);
                    last_error = NodeHealthError::EncodeFailed;
                    breadcrumb = NodeBreadcrumb::RetryBackoff;
                } else {
#if !GS_HIL_BUILD
                    security::SecureFrame protected_message;
                    if (!security_link.frames()->seal(security::RuntimeDirection::Uplink,
                                                      encoded.frame, protected_message)) {
                        runtime.transport_result(key, false, now);
                        last_error = NodeHealthError::EncodeFailed;
                        breadcrumb = NodeBreadcrumb::RetryBackoff;
                        continue;
                    }
                    ++send_attempts;
                    const esp_err_t sent = esp_now_send(security_link.hub_mac().data(),
                                                        protected_message.bytes.data(),
                                                        protected_message.size);
#else
                    ++send_attempts;
                    const esp_err_t sent = esp_now_send(kQualifiedHubMac.data(),
                                                        encoded.frame.bytes.data(),
                                                        encoded.frame.size);
#endif
                    energy.record_mac_attempt(true, sent == ESP_OK);
                    if (sent == ESP_OK) {
                        in_flight = key;
                        sent_at_ms = now;
                        breadcrumb = NodeBreadcrumb::WaitMac;
                        ESP_LOGI(kTag, "NodeMessage sent session=%llu seq=%llu bytes=%u",
                                 static_cast<unsigned long long>(key.session_id),
                                 static_cast<unsigned long long>(key.sequence),
                                 static_cast<unsigned>(encoded.frame.size));
                    } else {
                        runtime.transport_result(key, false, now);
                        last_error = NodeHealthError::SendRejected;
                        breadcrumb = NodeBreadcrumb::RetryBackoff;
                        ESP_LOGW(kTag, "esp_now_send failed error=%s", esp_err_to_name(sent));
                    }
                }
            }
        }

